{
  "_attn_implementation_autoset": true,
  "architectures": [
    "ViTModel"
  ],
  "attention_probs_dropout_prob": 0.0,
  "encoder_stride": 16,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "Enfeksiyonel",
    "1": "Ekzama",
    "2": "Akne",
    "3": "Pigment",
    "4": "Benign",
    "5": "Malign",
    "6": "Acne",
    "7": "Actinic Keratosis",
    "8": "Basal Cell Carcinoma",
    "9": "Benign Keratosis",
    "10": "Dermatofibroma",
    "11": "Melanocytic Nevus",
    "12": "Melanoma",
    "13": "Vascular Lesion",
    "14": "Warts/Molluscum"
},
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Enfeksiyonel": 0,
    "Ekzama": 1,
    "Akne": 2,
    "Pigment": 3,
    "Benign": 4,
    "Malign": 5,
    "Actinic Keratosis": 6,
    "Acne":7,
    "Basal Cell Carcinoma": 6,
    "Benign Keratosis": 7,
    "Dermatofibroma": 8,
    "Melanocytic Nevus": 9,
    "Melanoma": 12,
    "Vascular Lesion": 13,
    "Warts/Molluscum": 14
  },
  "layer_norm_eps": 1e-12,
  "model_type": "vit",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "pooler_act": "tanh",
  "pooler_output_size": 768,
  "qkv_bias": true,
  "torch_dtype": "float32",
  "transformers_version": "4.51.1"
}
